#ifndef __DPVSPRIVATEDEFS_HPP
#define __DPVSPRIVATEDEFS_HPP
/*****************************************************************************
 *
 * dPVS
 * -----------------------------------------
 *
 * (C) 1999-2001 Hybrid Holding, Ltd.
 * All Rights Reserved.
 *
 * This file consists of unpublished, proprietary source code of
 * Hybrid Holding, and is considered Confidential Information for
 * purposes of non-disclosure agreement. Disclosure outside the terms
 * outlined in signed agreement may result in irrepairable harm to
 * Hybrid Holding and legal action against the party in breach.
 *
 * Description: 	Private global definitions
 *
 * $Archive: /dpvs/implementation/include/dpvsPrivateDefs.hpp $
 * $Author: wili $ 
 * $Revision: #12 $
 * $Modtime: 12.11.02 18:37 $
 * $Date: 2003/08/24 $
 * 
 ******************************************************************************/

//------------------------------------------------------------------------
// Uncomment this to make the paranoid build (debug build only)
//------------------------------------------------------------------------

//#define DPVS_PARANOID

//------------------------------------------------------------------------
// Forward-declare some commonly used data structures.
//------------------------------------------------------------------------

#define DPVS_OVERRIDE_VECTOR_TYPES

namespace DPVS
{
	class Vector2i;									
	class Vector3i;									
	class Vector2;								
	class Vector3;								

#		if defined (DPVS_CPU_PS2)							// PlayStation2-specific pragmas
//PS2-BEGIN
#			pragma alignlabel on
#			pragma conditional_move on
#			pragma inline_intrinsics on 
#			pragma opt_unroll_loops on
#			pragma opt_vectorize_loops on
//PS2-END
#		elif defined (DPVS_OS_MAC)
//#			pragma opt_unroll_loops on
#			pragma opt_vectorize_loops on
#			pragma optimizewithasm on
#			pragma scheduling altivec
#		elif defined (DPVS_CPU_GAMECUBE)
//NGC-BEGIN
#			pragma fp_contract on 
#			pragma scheduling on
//NGC-END
#		endif
#	else 
#		pragma extended_errorcheck on						// extended error-checking
#	endif // DPVS_DEBUG
#endif // DPVS_BUILD_CW

#if defined (DPVS_BUILD_GCC)
#	define DPVS_ASM	__asm__									// assembly language block
#	define DPVS_SUPPORT_ATTRIBUTE							// support __attribute__
#	if defined (DPVS_PS2)
//PS2-BEGIN
#		define DPVS_ALIGN_VECTORS							// request vector alignment
#		define DPVS_PS2_ASSEMBLY							// use PS2 FPU assembler routines?
#		define DPVS_PS2_VU_ASSEMBLY							// use PS2 VU assembler routines?
#		define DPVS_PS2_USE_SCRATCHPAD						// define this to use the SPAD RAM on the PS2
//PS2-END
#	endif // DPVS_PS2
#endif // DPVS_BUILD_GCC

//------------------------------------------------------------------------
// Some compilation changes we must make if checking the code with
// PC-Lint or FlexeLint
//------------------------------------------------------------------------

#if defined (DPVS_LINT)									// seems like LINT doesn't support this
#	undef DPVS_FORCE_INLINE
#endif

//------------------------------------------------------------------------
// Compilation-time assertion. If the expression 'expr' evaluates to false,
// the compilation will be aborted and an error message will be given.
// Unfortunately the error message itself won't display the expression,
// so you will have to scan the source to the line given by the message
// to see which assertion went wrong. This variant of CT assertion can
// be used even inside class descriptions etc.
//
// Note that the CT assertion is evaluated in both release and debug
// builds (as it doesn't generate any real code).
//------------------------------------------------------------------------

#define DPVS_CT_ASSERT(expr) typedef bool DPVSCTAssertion[(expr) ? 1 : -1] 

//------------------------------------------------------------------------
// Define 16-bit integers (modify code below with #ifdefs if compiler
// asserts here about the size!)
//------------------------------------------------------------------------

typedef unsigned char			UINT8;					// 8-bit unsigned integer
typedef short int				INT16;                  // 16-bit signed integer
typedef unsigned short int		UINT16;                 // 16-bit unsigned integer
typedef unsigned int			UPTR;					// unsigned integer large enough to hold a void*

//------------------------------------------------------------------------
// Make sure that certain typedefs really do have the intended sizes
//------------------------------------------------------------------------

DPVS_CT_ASSERT(sizeof(UINT8)==1);
DPVS_CT_ASSERT(sizeof(INT16)==2);
DPVS_CT_ASSERT(sizeof(UINT16)==2);
DPVS_CT_ASSERT(sizeof(INT32)==4);
DPVS_CT_ASSERT(sizeof(UINT32)==4);
DPVS_CT_ASSERT(sizeof(float)==4);
DPVS_CT_ASSERT(sizeof(UPTR)>=sizeof(void*));
DPVS_CT_ASSERT(sizeof(size_t) >= sizeof(void*));

#if defined (DPVS_UINT64_DEFINED)
	DPVS_CT_ASSERT(sizeof(UINT64)==8);
	DPVS_CT_ASSERT(sizeof(INT64)==8);
#endif

//------------------------------------------------------------------------
// The macro DPVS_VFT_IN_END can be used for compiling conditional code
// based on the compiler's VFT table placement. The macro is defined for
// compilers that place the VFT to the _end_ of the structure (rather
// than the beginning). The code below ensures that the macro has been
// set correctly. If you get a compilation error, then go upwards to the
// compile recognition code and set DPVS_VFT_IN_END accordingly
// \todo [wili 021008] use offset_of or offsetof macros on some
//                     compilers?
//------------------------------------------------------------------------

#if defined (DPVS_BUILD_SGI) || defined (DPVS_BUILD_CW) || defined (DPVS_BUILD_INTELC) || defined (DPVS_BUILD_GCC) || defined (DPVS_BUILD_COMO)

enum
{
	VFT_IN_BEGIN = true
};

#else

	struct VFTTest
	{
		virtual ~VFTTest (void) {}
		int		m_data;
	};

	enum
	{
		VFT_IN_BEGIN = &((*((VFTTest*)(0))).m_data) == 0 ? false : true
	};

	#if defined (DPVS_VFT_IN_END)
		DPVS_CT_ASSERT(VFT_IN_BEGIN==false);
	#else
		DPVS_CT_ASSERT(VFT_IN_BEGIN==true);
	#endif // DPVS_VFT_IN_END

#endif

//------------------------------------------------------------------------
// Define DPVS_ATTRIBUTE for compilers that support __attribute__. Other
// compilers just ignore the attribute definition.
//------------------------------------------------------------------------

#if defined (DPVS_SUPPORT_ATTRIBUTE)
#	define DPVS_ATTRIBUTE(X) __attribute__ (X)
#else
#	define DPVS_ATTRIBUTE(X) (DPVS_NULL_STATEMENT)
#endif

// useful DPVS_ATTRIBUTES:
//funcs: pure - uses only arguments & globals
//funcs: const - uses only arguments, no globals, no effects apart from return value (cannot read global memory)
//funcs: malloc - pointer returned cannot alias
//variables & structs: aligned(X) - alignment

//------------------------------------------------------------------------
// If the compiler supports ALIGN directives, then define them here
//------------------------------------------------------------------------

#if defined (DPVS_BUILD_MSC_PPACK) || defined (DPVS_BUILD_INTELC)
#	define DPVS_ALIGN(X,T) __declspec(align(X)) T
#elif defined (DPVS_BUILD_CW) && !defined (DPVS_OS_GAMECUBE)
#	define DPVS_ALIGN(X,T) __attribute__((aligned(X))) T
#elif defined (DPVS_BUILD_CW) && defined (DPVS_OS_GAMECUBE)
//NGC-BEGIN
#	define DPVS_ALIGN(X,T) T __attribute__((aligned(X)))
//NGC-END
#elif defined (DPVS_BUILD_GCC)
#	define DPVS_ALIGN(X,T) __attribute__((aligned(X))) T
#else
#	define DPVS_ALIGN(X,T) T 
#endif

#define DPVS_ALIGN8(T) DPVS_ALIGN(8,T)
#define DPVS_ALIGN16(T) DPVS_ALIGN(16,T)
#define DPVS_ALIGN32(T) DPVS_ALIGN(32,T)

//------------------------------------------------------------------------
// Ensure that all macros used are defined somehow (even empty is ok)
//------------------------------------------------------------------------

#if !defined (DPVS_FORCE_INLINE)
#	define DPVS_FORCE_INLINE inline
#endif

#if !defined (DPVS_ASM)
#	define DPVS_ASM __asm									// assembly language block
#endif

#if !defined (DPVS_RESTRICT)								// the "restrict" keyword
#	define DPVS_RESTRICT
#endif

//------------------------------------------------------------------------
// Macros for testing alignment of data
//------------------------------------------------------------------------

DPVS_FORCE_INLINE bool isDWordAligned (const void* p) { return !(reinterpret_cast<UPTR>(p)&3);		}
DPVS_FORCE_INLINE bool isQWordAligned (const void* p) { return !(reinterpret_cast<UPTR>(p)&7);		}
DPVS_FORCE_INLINE bool is128Aligned   (const void* p) { return !(reinterpret_cast<UPTR>(p)&15);	}

//------------------------------------------------------------------------
// The for() fix macro for compilers that don't respect the C++ standard.
//------------------------------------------------------------------------

#if defined (DPVS_BUILD_MSC) || defined (DPVS_BUILD_SGI)
DPVS_FORCE_INLINE bool getFalse (void) { return false; }
#	define for if(DPVS::getFalse()){} else for
#elif defined (DPVS_BUILD_CW) && !defined(DPVS_OS_MAC)
#	define for if(false){} else for
#endif

//------------------------------------------------------------------------
// Some Commonly used templates
//------------------------------------------------------------------------

template <class T> DPVS_FORCE_INLINE void swap (T& a, T& b) { T t(a); a = b; b = t; }

//------------------------------------------------------------------------
// Data alignment functions
//------------------------------------------------------------------------

const size_t CACHE_LINE_SIZE = 32;										// use 32-byte cache lines (this is conservative and valid assumption on modern hardware)

template <class T> DPVS_FORCE_INLINE T* alignPow2		(T* foo, int ALIGN)	{ return reinterpret_cast<T*>(((size_t)(foo)+(size_t)(ALIGN-1))&~(size_t)(ALIGN-1)); }
template <class T> DPVS_FORCE_INLINE T* alignCacheLine	(T* foo)			{ return alignPow2(foo, CACHE_LINE_SIZE);	}
template <class T> DPVS_FORCE_INLINE T* align128		(T* foo)			{ return alignPow2(foo, 16);				}

//------------------------------------------------------------------------
// This function returns a "bad pointer" i.e. a pointer that cannot
// be returned by any true allocation. This pointer can be used to
// distinguish non-pointer values if null is used for some other
// purpose.
//------------------------------------------------------------------------

extern "C" void* g_invalidPointer;
DPVS_FORCE_INLINE const void* getInvalidPointer (void)
{
	return (const void*) g_invalidPointer;
}

//------------------------------------------------------------------------
// Function for changing endianess of a 32-bit value
//------------------------------------------------------------------------

DPVS_FORCE_INLINE UINT32 changeEndian(UINT32& a)
{
#if defined(DPVS_X86_ASSEMBLY)
	DPVS_ASM
	{
		mov		eax,a
		mov		ecx,[eax]
		bswap	ecx
		mov		[eax],ecx	
	}
#else
	a = (a<<24) | ((a<<8)&0xFF0000) | ((a>>8)&0xFF00) | (a>>24);
#endif
	return a;
}

//------------------------------------------------------------------------
// Union of a 32-bit float and a 32-bit integer. This union is used
// if we need to manipulate floats as integers as reinterpret_cast
// may not work correctly on all compilers (for example MSVC).
//------------------------------------------------------------------------

union FloatInt
{
	float	f;					// floating-point
	UINT32	i;					// integer (unsigned)
};

DPVS_CT_ASSERT(sizeof(FloatInt)==4);

//------------------------------------------------------------------------
// Some compilers define macros that may clash with out function naming
//------------------------------------------------------------------------

#undef min
#undef max

//------------------------------------------------------------------------
// Assertions for debug build ("assume construction" not used any more as
// it inteferes with code optimization on MSVC6)
//------------------------------------------------------------------------

void assertFail (const char* expr, const char* file, int line, const char* message); 

#if defined (DPVS_DEBUG) && !defined (DPVS_DISABLE_ASSERTS)
#	define DPVS_ASSERT(e)			((e) ? DPVS_NULL_STATEMENT : DPVS::assertFail(#e,__FILE__,__LINE__,""))
#	define DPVS_ASSERT_PRINT(a,b)	((a) ? DPVS_NULL_STATEMENT : DPVS::assertFail(#a,__FILE__,__LINE__,#b))
